ISEM/src/Catalogs/ИнтеграцииСистем/ИнтеграцииСистем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнтеграцииСистем</name>
  <attributes>
    <name>УдалитьМетаданные</name>
    <type>
      <types>CatalogRef.МетаданныеИнформационныхСистем</types>
    </type>
  </attributes>
  <attributes>
    <name>ИС</name>
    <type>
      <types>CatalogRef.ИнформационныеСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехнологияИнтеграции</name>
    <type>
      <types>CatalogRef.ТехнологииИнтеграций</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияИнтеграции</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>CatalogRef.ФорматыИнтеграцийСистем</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеИнтеграций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>ИС</name>
      <type>
        <types>CatalogRef.ИнформационныеСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Источники</name>
    <attributes>
      <name>ИС</name>
      <type>
        <types>CatalogRef.ИнформационныеСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеИнтеграции</name>
    <attributes>
      <name>Интеграция</name>
      <type>
        <types>CatalogRef.ИнтеграцииСистем</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТочкиВхода</name>
    <attributes>
      <name>ТочкаВхода</name>
      <type>
        <types>CatalogRef.ТочкиВходаИнтеграций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МетаданныеСистем</name>
    <attributes>
      <name>МетаданноеСистемы</name>
      <type>
        <types>CatalogRef.МетаданныеИнформационныхСистем</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Атрибуты</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.Атрибуты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.Атрибуты</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ISEM/src/Enums/НаправленияИнтеграции/НаправленияИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НаправленияИнтеграции</name>
  <enumValues>
    <name>Входящая</name>
  </enumValues>
  <enumValues>
    <name>Исходящая</name>
  </enumValues>
  <enumValues>
    <name>ВходящаяИсходящая</name>
  </enumValues>
</mdclass:Enum>

ISEM/src/Catalogs/ИнтеграцииСистем/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
// ISEM: Менеджер интеграций между информационными системами
//
// Copyright 2017-2023 Dmitry Makarevich (Mity1440)
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
//
// URL:    https://github.com/Mity1440/ISEM
// e-mail: mitia.mackarevich@yandex.ru

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;  
	
	ЗаписатьДополнительныеСвойстваПередЗаписью();
	ОчиститьПолучателейИсточниковПоНеобходимости();

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьДанныеИнтеграцийДляСписка();
	
КонецПроцедуры

#КонецОбласти       

#Область СлужебныеПроцедурыИФункции      

Процедура ЗаписатьДополнительныеСвойстваПередЗаписью()
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
КонецПроцедуры

Процедура ОчиститьПолучателейИсточниковПоНеобходимости()
	
	Если Направление = Перечисления.НаправленияИнтеграции.Входящая Тогда
		Получатели.Очистить();
	ИначеЕсли Направление = Перечисления.НаправленияИнтеграции.Исходящая Тогда
		Источники.Очистить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьДанныеИнтеграцийДляСписка()
	
	СуществующаяИнтеграция = НЕ ДополнительныеСвойства.ЭтоНовый;
	РегистрыСведений.ИнтеграцииСистемДанныеДляСписка.ЗаписатьДанные(Ссылка, СуществующаяИнтеграция);
	
КонецПроцедуры

#КонецОбласти 

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте'");
#КонецЕсли
